Repository: DavidePrincipi/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/hotsync.po
Languages: it

source: HotSync should be considered a `beta release <https://en.wikipedia.org/wiki/Software_release_life_cycle#Beta>`_. Please test it on your environment before using in production.
it: Il moduflo HotSync è da considerarsi una `release beta <https://en.wikipedia.org/wiki/Software_release_life_cycle#Beta>`_. Pertanto è opportuno provarla in ambienti di test prima di procedere in produzione.

source: HotSync aims to reduce downtime in case of failure, syncing your |product| with another one, that will be manually activated in case of master server failure.
it: HotSync mira a ridurre i tempi di inattività in caso di problemi, sincronizzando il |product| con un altro sistema gemello, che verrà attivato manualmente in caso di guasto del server master.

source: Normally, when a hardware damage occurs, the time needed to restore service is:
it: Normalmente, quando si verifica un problema hardware, il tempo necessario per ripristinare il servizio è:

source: fix/buy another server: from 4h to 2 days
it: riparazione/approvvigionamento nuovo server: da 4h a 2 giorni

source: install OS: 30 minutes
it: installazione sistema operativo: 30 minuti

source: restore backup: from 10 minutes to 8 hours
it: ripristino backup: da 10 minuti a 8 ore

source: In summary, users are able to start working again with data from the night before failure after a few hours/days. Using hotsync, time 1 and 3 are 0, 2 is 5 minutes (time to activate spare server). Users are able to start working again in few minutes, using data from a few minutes before the crash.
it: In sintesi, gli utenti possono ricominciare a lavorare con i dati della notte precedente al guasto dopo alcune ore/giorni. Utilizzando hotsync, il tempo per le fasi 1 e 3 è praticamente 0, per la fase 2 è ridotto a 5 minuti (tempo per attivare il server di riserva). Gli utenti possono ricominciare a lavorare in pochi minuti, utilizzando i dati di alcuni minuti prima del crash.

source: By default all data included in backup are synchronized every 15 minutes. MariaDB databases are synchronized too, unless databases synchronization isn't disabled. Applications that use PostgreSQL are synchronized (Mattermost, Webtop5) unless databases synchronization isn't disabled.
it: Per impostazione predefinita, tutti i dati inclusi nel backup vengono sincronizzati ogni 15 minuti. Anche i database MariaDB sono sincronizzati, a meno che la sincronizzazione dei database non sia disabilitata. Le applicazioni che utilizzano PostgreSQL sono sincronizzate (Mattermost, Webtop5) a meno che la sincronizzazione dei database non sia disabilitata.

source: Terminology
it: Terminologia

source: MASTER is the production system SLAVE is the spare server
it: MASTER è il sistema di produzione SLAVE è il server di riserva

source: SLAVE is switched on, with an IP address different than MASTER
it: SLAVE è acceso, con un indirizzo IP diverso da MASTER

source: Every 15 minutes, MASTER makes a backup on SLAVE
it: Ogni 15 minuti, MASTER esegue un backup su SLAVE

source: An email is sent to root (admin if mail server is installed)
it: Un'e-mail viene inviata a root (admin se è installato il server di posta)

source: Installation
it: Installazione

source: Install nethserver-hotsync on both MASTER and SLAVE, execute from command line: ::
it: Per installare nethserver-hotsync su MASTER e SLAVE, esegure dalla riga di comando: ::

source: Install nethserver-hotsync on both MASTER and SLAVE.
it: Installare nethserver-hotsync sia sul MASTER che sullo SLAVE

source: To install the module on MASTER execute from command line: ::
it: Per installare il modulo sul MASTER lanciare da shell il comando: ::

source: To install the module on SLAVE execute from command line: ::
it: Per installare il modulo sullo SLAVE lanciare da shell il comando: ::

source: Configuration
it: Configurazione

source: The ``<PASSWORD>`` must be the same on master and slave.
it: La ``<PASSWORD>`` deve essere la stessa sul master e sullo slave.

source: If mysql or postgresql are installed, they will be synchronized by default. To disable databases sync
it: Se mysql o postgresql sono installati, saranno sincronizzati per impostazione predefinita. Per disabilitare la sincronizzazione dei database

source: Enabling/Disabling
it: Abilitazione/Disabilitazione

source: Hotsync is enabled by default. To disable it:
it: Hotsync è abilitato di default. Per disabilitarlo:

source: and to re-enable it:
it: e per riabilitarlo:

source: Restore: put SLAVE in production
it: Ripristino: promuovere lo SLAVE in produzione

source: The following procedure puts the SLAVE in production when the master has crashed.
it: La seguente procedura mette in produzione lo SLAVE in caso di arrewsto anomalo del master.

source: switch off MASTER
it: spegnere il MASTER

source: if the SLAVE machine must run as network gateway, connect it to the router/modem with a network cable
it: se lo SLAVE deve funzionare come gateway di rete, collegarlo al router/modem con un cavo di rete

source: on SLAVE, if you are connected through an ssh console, launch the ``screen`` command, to make your session survive to network outages::
it: sullo SLAVE, se si è connessi tramite una console ssh, lanciare il comando ``screen``, per fare in modo che la sessione sopravviva in caso di interruzioni di rete: ::

source: on SLAVE launch the following command, and read carefully its output ::
it: lanciare sullo SLAVE il seguente comando e leggere attentamente l'output generato ::

source: go to Server Manager, in page ``Network`` and reassign roles to network interfaces as required
it: spostarsi nella pagina ``Rete`` del Server Manager e riassegnare i ruoli alle interfacce di rete secondo necessità

source: launch the command ::
it: lanciare il comando ::

source: update the system to the latest packages version ::
it: aggiorna il sistema alla versione più recente dei pacchetti ::

source: if an USB backup is configured on MASTER, connect the backup HD to SLAVE
it: se sul MASTER era configurato un backup su USB, collegare il disco di backup allo SLAVE

source: Supported packages
it: Pacchetti supportati

source: nethserver-webtop5 (z-push state is not synchronized)
it: nethserver-webtop5 (lo stato di z-push non è sincronizzato)
