Repository: DavidePrincipi/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/migration.po
Languages: es

source: Migration from NethService/SME Server
es: Migración del servidor NethService/SME

source: Migration is the process to convert a SME Server/NethService machine (:dfn:`source`) into a |product| (:dfn:`destination`).
es: La migración es el proceso para convertir una máquina SME Server/NethService (:dfn:`source`) en un |product| (:dfn:`destination`).

source: In the source host, create a full backup archive and move it to the destination host.
es: En el host de origen, cree un archivo de copia de seguridad completo y muévalo al host de destino.

source: In the destination host, install all packages that cover the same features of the source.
es: En el host de destino, instale todos los paquetes que cubran las mismas características del origen.

source: Explode the full backup archive into some directory; for instance, create the directory :file:`/var/lib/migration`.
es: Descargar el archivo de copia de seguridad completo en algún directorio; Por ejemplo, cree el directorio :file:`/var/lib/migration`.

source: This step will require some time.
es: Este paso requerirá algún tiempo.

source: Check for any error message in :file:`/var/log/messages`::
es: Compruebe si hay algún mensaje de error en :file:`/var/log/messages`::

source: No custom template is migrated during the migration process. Check the new template files before copying any custom fragment from the old backup.
es: No se migra ninguna plantilla personalizada durante el proceso de migración. Compruebe los archivos de la plantilla nueva antes de copiar cualquier fragmento personalizado de la copia de seguridad antigua.

source: Email
es: Correo electrónico

source: Before running |product| in production, some considerations about the network and existing mail client configurations are required: what ports are in use, if SMTPAUTH and TLS are enabled. Refer to :ref:`email_clients` and :ref:`email_policies` sections for more informations.
es: Antes de ejecutar el |product| en producción, se requieren algunas consideraciones sobre la red y las configuraciones de cliente de correo existentes: qué puertos están en uso, si SMTPAUTH y TLS están habilitados. Consulte las secciones :ref:`email_clients` y :ref:`email_policies` para obtener más información.

source: In a mail server migration, the source mail server could be on production even after the backup has been done, and email messages continue to be delivered until it is taken down permanently.
es: En una migración de servidor de correo, el servidor de correo de origen podría estar en producción incluso después de que se haya realizado la copia de seguridad y los mensajes de correo electrónico continúan siendo entregados hasta que se borran permanentemente.

source: The source host at ``IPADDR`` must be accessible by the ``root`` user, through ``ssh`` with public key authentication.
es: El host de origen en ``IPADDR`` debe ser accesible por el usuario ``root``, a través de ``ssh`` con autenticación de clave pública.
