Repository: DavidePrincipi/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/nextcloud.po
Languages: es, it

source: `Nextcloud <http://nextcloud.com/>`_ provides universal access to your files via the web, your computer or your mobile devices wherever you are. It also provides a platform to easily view and synchronize your contacts, calendars and bookmarks across all your devices and enables basic editing right on the web.
es: `Nextcloud <http://nextcloud.com/>`_ proporciona acceso universal a sus archivos a través de la web, su computadora o sus dispositivos móviles dondequiera que se encuentre. También proporciona una plataforma para ver y sincronizar fácilmente sus contactos, calendarios y marcadores en todos sus dispositivos y permite la edición básica directamente en la web.
it: `Nextcloud <http://nextcloud.com/>`_ è una soluzione flessibile per la sincronizzazione dei file e la loro condivisione. È possibile avere i propri file sempre a portata di mano su ogni dispositivo, utilizzando un dispositivo mobile, un personal computer, una workstation o un accesso web. La condivisione viene realizzata in maniera semplice, sicura e privata che significa avere il pieno controllo dei propri dati.

source: **Key features:**
es: **Características principales:**
it: *Funzionalità:*

source: preconfigure :index:`Nextcloud` with MariaDB and default access credential
es: preconfigurar :index:`Nextcloud` con MariaDB y credencial de acceso predeterminada
it: configurazione automatica di :index:`Nextcloud` con database MariaDB con credenziali di default

source: integration with |product| system users and groups
es: Integración con usuarios y grupos del sistema |product|
it: integrazione automatica con gli utenti e gruppi di sistema di |product|

source: automatic backup data with nethserver-backup-data tool
es: Datos de copia de seguridad automática con la herramienta nethserver-backup-data
it: backup dei dati automatico tramite nethserver-backup-data

source: customize https access url (custom virtual host)
it: personalizzare l'URL di accesso https (host virtuale personalizzato)

source: Installation
es: Instalación
it: Installazione

source: The installation can be done through the |product| web interface. After the installation:
es: La instalación se puede culminar a través de la interfaz web de |product|. Después de la instalación:
it: È possibile installare |product| tramite l’interfaccia web di |product|. Dopo l’installazione:

source: open the url https://your_nethserver_ip/nextcloud
es: abrir la url https://your_nethserver_ip/nextcloud
it: collegarsi all’url https://your_nethserver_ip/nextcloud

source: use **admin/Nethesis,1234** as default credentials
es: use **admin/Nethesis,1234** como credenciales por defecto
it: usare le credenziali di default **admin/Nethesis,1234**

source: change the default password
es: cambiar la contraseña por defecto
it: cambiare la password di default

source: All users configured inside any user provider (see :ref:`users_and_groups-section`) can automatically access the NextCloud installation. After the installation a new application widget is added to the |product| web interface dashboard.
es: Todos los usuarios configurados dentro de cualquier proveedor de usuarios (ver :ref:`users_and_groups-section`) pueden acceder automáticamente a la instalación de NextCloud. Después de la instalación, se agrega un nuevo widget de aplicación al panel de interfaz web |product|.
it: Ciascun utente presente nel sistema può accedere automaticamente tramite le sue credenziali, indipendentemente dal provider utenti utilizzato (vedi :ref:`users_and_groups-section`). Dopo l’installazione sarà presente anche un nuovo widget applicazioni nella dashboard di |product|.

source: Nextcloud update/upgrade procedure disables the apps to avoid incompatibility problems. Server logs keep track of which apps were disabled. After a successful update/upgrade procedure you can use the Applications page to update and re-enable the apps.
it: La procedura di aggiornamento/cambio di versione di Nextcloud disabilita le app per evitare problemi di compatibilità. I registri del server tengono traccia di quali app sono state disabilitate. Dopo una corretta procedura di aggiornamento / cambio di versione è possibile utilizzare la pagina Applicazioni per aggiornare e riattivare le app.

source: Nextcloud version 13 uses new PHP 7.1 (`nethserver-rh-php71-php-fpm`) while older version uses PHP 5.6 (`nethserver-rh-php56-php-fpm`). You can remove php56 version (if there are no dependency problems) with the command "yum remove nethserver-rh-php56-php-fpm".
it: La versione 13 di Nextcloud utilizza il nuovo PHP 7.1 (`nethserver-rh-php71-php-fpm`) mentre la versione precedente utilizza PHP 5.6 (`nethserver-rh-php56-php-fpm`). È possibile rimuovere php56 (se non ci sono problemi di dipendenze) con il comando "yum remove nethserver-rh-php56-php-fpm".

source: User list
es: Lista de usuarios
it: Lista utenti

source: All users are listed inside the administrator panel of NextCloud using a unique identifier containing letters and numbers. This is because the system ensures that there are no duplicate internal user names as reported in section `Internal Username` of `Official NextCloud documentation <https://docs.nextcloud.com>`_.
es: Todos los usuarios se enumeran dentro del panel del administrador de NextCloud usando un identificador único que contiene letras y números. Esto se debe a que el sistema asegura que no hay nombres de usuario internos duplicados como se informó en la sección `Nombre de usuario interno` de `Official NextCloud documentation <https://docs.nextcloud.com>`_.
it: Tutti gli utenti vengono elencati nel pannello dell'amministratore di NextCloud utilizzando un identificativo alfanumerico univoco. In questo modo il sistema garantisce l'assenza di duplicati nei nomi utente interni, come spiegato nella sezione `Internal Username` della `Documentazione ufficiale di NextCloud <https://docs.nextcloud.com>`_.

source: If |product| is bound to a remote Active Directory account provider a dedicated user account in AD is required by the module to be fully operational! See :ref:`join-existing-ad-section`.
es: Si |product| es unido a un proveedor de cuentas Directorio Activo remoto, se necesita una cuenta AD dedicada para que el módulo esté completamente operativo. Ver :ref:`join-existing-ad-section`.
it: Se |product| è attestato ad un account provider remoto Active Directory, un account utente AD aggiuntivo e dedicato è necessario al modulo per essere pienamente operativo! Fare riferimento alla sezione :ref:`join-existing-ad-section`.

source: Custom Virtual Host
it: Host virtuale personalizzato

source: To customize the Nextcloud web url: ::
it: Per personalizzare l'url web di Nextcloud: ::

source: If you use :ref:`let's encrypt <server_certificate-section>` remember to add the domain name to the proper list.
it: Se si utilizza :ref:`let's encrypt <server_certificate-section>` ricordarsi di aggiungere il nome di dominio all'elenco dedicato.

source: Trusted domains are a list of domains that users can log into. Default trusted domains are:
es: Los dominios de confianza son una lista de dominios en los que los usuarios pueden iniciar sesión. Los dominios de confianza predeterminados son:
it: I Trusted domains sono una lista di domini su cui l’utente può effettuare il login. Quelli presenti di default sono:

source: domain name
es: nombre de dominio
it: nome dominio

source: ip address
es: dirección ip
it: indirizzo ip

source: To add a new one use: ::
es: Para añadir uno nuevo use: ::
it: Per aggiungerne uno nuovo eseguire: ::

source: To add more than one, concatenate the names with a comma.
es: Para agregar más de uno, concatene los nombres con una coma.
it: Per aggiungerne più di uno è sufficiente concatenare i nomi con una virgola.

source: CalDAV and CardDAV
it: CalDAV e CardDAV

source: Some CalDAV and CardDAV clients may have problems finding the proper sync URL and need automatic service discovery. Service discovery is enabled by default if a custom virtual host for Nexcloud has been configured.
it: Alcuni client CalDAV e CardDAV possono avere problemi nel trovare l'URL di sincronizzazione appropriato e richiedono il rilevamento automatico dei servizi. L'individuazione del servizio è abilitata per impostazione predefinita se è stato configurato un host virtuale personalizzato per Nexcloud.

source: To enable the service discovery even if Nextcloud is running on the main FQDN, under the ``nextcloud`` subfolder, please make sure you do not have WebTop or SOGo already installed. Then execute: ::
it: Per abilitare il rilevamento automatico dei servizi anche se Nextcloud è in esecuzione sul FQDN principale, nella sottocartella ``nextcloud``, assicurarsi che WebTop o SOGo non siano installati. Quindi eseguire: ::

source: Trusted Domains
es: Dominios confiables
