Repository: DavidePrincipi/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/phone_home.po
Languages: it

source: This tool is used to track all NethServer's installations around the world. Each time a new NethServer is installed, this tool sends some installation information through comfortable APIs. The information are stored in database and used to display nice markers in a Google Map view with number of installation grouped by country and release.
it: Il phone home viene usato per tenere traccia di tutte le installazioni di NethServer nel mondo. Ogni volta che si installa un nuovo NethServer, questa applicazione invia alcuni dettagli sull’installazione per mezzo di specifiche API. Le informazioni vengono memorizzate in un database e utilizzate per mostrare dei marcatori in una mappa Google contenente il numero di installazioni attive raggruppate per paese e versione.

source: Overview
it: Panoramica

source: The tool is *disabled* by default.
it: Questa applicazione è *disabilitata* di default.

source: To enable it simply run: ``config set phone-home configuration status enabled``
it: Per abilitarla, eseguire: ``config set phone-home configuration status enabled``

source: If the tool is *enabled* the information sent are:
it: Se il phone home è *abilitato* le informazioni inviate sono:

source: UUID: stored in ``/var/lib/yum/uuid``
it: UUID: che si trova in ``/var/lib/yum/uuid``

source: RELEASE: get by ``/sbin/e-smith/config getprop sysconfig Version``
it: RELEASE: ottenuto da ``/sbin/e-smith/config getprop sysconfig Version``

source: All the infos are used to populate the map.
it: Tutte le informazioni sono usate per popolare la mappa.

source: Configuration
it: Configurazione

source: If you use a proxy edit the correct placeholders in file ``phone-home`` stored in ``/etc/sysconfig/`` : ::
it: Se si utilizza un proxy, modificare opportunamente i relativi segnaposto che si trovano nel file ``phone-home`` disponibile nel percorso ``/etc/sysconfig/`` : ::
