Repository: DavidePrincipi/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/pop3_connector.po
Languages: it

source: POP3 connector
it: Connettore POP3

source: Since |product| 7.5.1804 new :ref:`email-section`, :ref:`pop3_connector-section` and :ref:`pop3_proxy-section` installations are based on the Rspamd filter engine. Previous |product| installations are automatically upgraded to Rspamd as described in :ref:`email2-section`
it: Con il rilascio di |product| 7.5.1804 le nuove installazioni di :ref:`email-section`, :ref:`pop3_connector-section` e :ref:`pop3_proxy-section` sono basate sul motore di filtraggio Rspamd. Le precedenti installazioni di |product| verranno automaticamente aggiornate a Rspamd come descritto nella sezione :ref:`email2-section`

source: The :index:`POP3 connector` is part of the :guilabel:`Email` application inside the new Server Manager and it is accessible from the list of user mailboxes. The same configuration is accessible from the old Server Manager, from the :guilabel:`POP3 connector` page.
it: Il :index:`Connettore POP3` fa parte dell'applicazione :guilabel:`Email` nel nuovo Server Manager ed è accessibile dall'elenco delle caselle di posta. La stessa configurazione è accessibile dal vecchio Server Manager, dalla pagina :guilabel:`Connettore POP3`.

source: Configured external accounts will be checked regularly and retrieved messages will be delivered to local users.
it: Gli account esterni configurati verranno controllati regolarmente e i messaggi scaricati saranno consegnati agli utenti locali.

source: It is not recommended to use the POP3 connector as the primary method for managing email. Mail delivery can be affected by disk space and connectivity problems of the provider's server. Also, the spam filter will be less effective due to the original email envelope information becoming lost.
it: Non è consigliabile utilizzare il connettore POP3 come metodo principale per la gestione della posta elettronica. Il recapito della posta può essere influenzato dallo spazio su disco e dai problemi di connettività del server del provider. Inoltre, il filtro antispam sarà meno efficace a causa della perdita delle informazioni contenute nell'envelope della mail originale.

source: POP3/IMAP accounts are configured from :guilabel:`POP3 connector > Accounts` page. Each account can be specified:
it: Gli account POP3/IMAP sono configurabili dalla pagina :guilabel:`Connettore POP3 > Indirizzi esterni`. Per ogni account possono essere specificati:

source: the email address (as unique account identifier)
it: l’indirizzo email (come identificativo univoco per l’account)

source: the protocol (IMAP/POP3/IMAP with SSL/POP3 with SSL)
it: il protocollo (IMAP/POP3/IMAP con SSL/POP3 con SSL)

source: the remote server address
it: l’indirizzo del server remoto

source: the account credentials
it: le credenziali dell’account

source: the local user account where to deliver messages
it: l’utente locale a cui consegnare i messaggi

source: if a message has to be deleted from the remote server after delivery
it: se un messaggio vada eliminato dal server remoto dopo la consegna

source: antispam and antivirus checks
it: controlli antispam e antivirus

source: It is allowed to associate more than one external accounts to a local one. Deleting an account will *not* delete already delivered messages.
it: È consentito associare più account esterni ad uno locale. L'eliminazione di un account *non* cancellerà i messaggi già consegnati.

source: After the account configuration has been completed, the account is automatically checked for new mail.
it: Completata la configurazione di un account, questo viene automaticamente controllato per rilevare la presenza di nuovi messaggi di posta.

source: The underneath implementation is based on :dfn:`Getmail` [#Getmail]_. After fetching mail messages from the POP3/IMAP provider Getmail applies all required filters (SPAM and virus) prior to delivering the mail locally. All messages are filtered according to the :ref:`configured rules <email_filter>`.
it: L’implementazione è basata su :dfn:`Getmail` [#Getmail]_. Dopo aver scaricato i messaggi dal provider POP3/IMAP remoto, Getmail applica tutti i filtri attivati (spam e virus), quindi consegna il messaggio localmente. I messaggi vengono filtrati in base alle :ref:`regole configurate <email_filter>`.

source: All operations are logged in :file:`/var/log/maillog`.
it: Tutte le operazioni di download sono riportate nel file :file:`/var/log/maillog`.

source: If an account was selected for delivery and has been subsequently deleted the configuration becomes inconsistent. If this should happen then existing account configuration in :guilabel:`POP3 connector` page must be disabled or deleted.
it: Se un account scelto per la consegna venisse successivamente eliminato, la configurazione diventerebbe inconsistente. Se questo dovesse accadere la relativa configurazione esistente nella pagina :guilabel:`Connettore POP3` dovrà essere disabilitata o eliminata.

source: References
it: Riferimenti

source: Getmail is a remote-mail retrieval utility http://pyropus.ca/software/getmail/
it: Getmail è un programma per il download di email da remoto http://pyropus.ca/software/getmail/
