Repository: DavidePrincipi/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/upgrade_tool.po
Languages: it

source: The :guilabel:`Upgrade tool` module upgrades |product| from version 6 to version 7 with an automated procedure that acts in three steps:
it: Il modulo :guilabel:`Upgrade tool` consente di aggiornare |product| dalla versione 6 alla versione 7 attraverso una procedura automatica che agisce in tre passaggi:

source: **preparation**: downloads all required packages from the configured software repositories
it: **preparazione**: scarica tutti i pacchetti richiesti dai repository software configurati

source: **upgrade**: at next reboot runs the packages upgrade transaction, the upgrade tasks, then reboots automatically
it: **aggiornamento**: al successivo riavvio esegue la transazione di aggiornamento dei pacchetti, le attività di aggiornamento, quindi si riavvia automaticamente

source: **post-upgrade**: completes by fully re-configuring the system
it: **post-aggiornamento**: esegue la riconfigurazione completa del sistema

source: Each step is described in the sections below. The time estimations depend on the number of packages, internet connection, CPU and disks speed.
it: Ogni passaggio è descritto nelle sezioni seguenti. Le stime temporali dipendono dal numero di pacchetti, dalla connessione Internet, dalla CPU e dalla velocità dei dischi.

source: Read carefully :ref:`upgrade_risks_section`
it: Leggere attentamente :ref:`upgrade_risks_section`

source: Preparation step
it: Fase di preparazione

source: Estimated time: 1 hour
it: Tempo stimato: 1 ora

source: The (1) **preparation** step can be started from the :guilabel:`Upgrade tool` page of the Server Manager.
it: La fase di (1) **preparazione** può essere avviata dalla pagina :guilabel:`Upgrade tool` del Server Manager.

source: If the File server module is present and the Samba server role is :guilabel:`Primary Domain Controller` or :guilabel:`Workstation` the system has to be configured with a local Active Directory accounts provider. See :ref:`upgrade-to-ad`.
it: Se il modulo File server è presente e il ruolo del server Samba è :guilabel:`Domain Controller Primario` o :guilabel:`Workstation` il sistema deve essere configurato con un account provider Active Directory locale. Vedi :ref:`upgrade-to-ad`.

source: The Upgrade tool does not work if the Samba server role is set to :guilabel:`Active Directory Member`.
it: L'upgrade tool non può essere utilizzato se il ruolo del server Samba è impostato su :guilabel:`Membro Active Directory`.

source: During the preparation step the system is still operational as usual. The package download runs in background. It requires some time, depending on the available network bandwidth.
it: Durante la fase di preparazione il sistema è ancora completamente operativo. Il download dei pacchetti viene eseguito in background. L'operazione può richiedere del tempo, anche in virtù della banda di rete disponibile.

source: The available disk space is checked twice, before and after the preparation step, to ensure the next steps do not run in short of disk space.
it: Lo spazio disponibile sul disco viene controllato due volte, prima e dopo la fase di preparazione, per garantire che i passaggi successivi non vengano eseguiti nel caso in cui lo spazio su disco fosse insufficiente.

source: At the end of the download the web page asks to abort the procedure or continue with the system reboot to the upgrade step.
it: Terminato il download, dalla pagina Web è possibile interrompere la procedura o continuare con il riavvio del sistema per lanciare la successiva fase di aggiornamento.

source: Upgrade step
it: Fase di aggiornamento

source: Estimated time: 30 minutes
it: Tempo stimato: 30 minuti

source: The (2) **upgrade** step starts at the next system reboot. The upgrade procedure boots the Linux kernel of version 7 by default. If the disk controller is not compatible with it, the procedure fails at this point.
it: La fase (2) **aggiornamento** inizia al successivo riavvio del sistema. La procedura di aggiornamento avvia il kernel Linux della versione 7 per impostazione predefinita. Se il controller del disco a bordo della macchina non dovesse essere compatibile con esso, la procedura fallirà.

source: It is possible to select the old kernel and boot the system in the previous state, actually aborting the upgrade
it: È possibile selezionare il vecchio kernel per avviare il sistema nello stato precedente, interrompendo così l'aggiornamento

source: If the new kernel boots and mounts the disks correctly the system is **disconnected from the network** and the packages upgrade starts. From this point there is no way back. During the upgrade the system can be accessed from the system console.
it: Se la macchina si avvia con il nuovo kernel e monta correttamente i dischi, il sistema viene **disconnesso dalla rete** ed inizia l'aggiornamento dei pacchetti. Da questo punto non si può tornare indietro. Durante la fase di aggiornamento è possibile accedere al sistema solo dalla console di sistema.

source: It takes some time to upgrade all the packages, depending on the system speed and the number of the packages. At the end of the upgrade step the system is automatically rebooted.
it: L'aggiornamento può richiedere del tempo, a seconda della velocità del sistema e del numero dei pacchetti. Alla fine della fase di aggiornamento il sistema viene automaticamente riavviato.

source: Post-upgrade step
it: Fase di post-aggiornamento

source: Estimated time: 15 minutes
it: Tempo stimato: 15 minuti

source: The (3) **post-upgrade** step starts at the second reboot.
it: La fase di (3) **post-aggiornamento** viene lanciata al secondo riavvio.

source: The basic system was completely upgraded by the previous step; the post-upgrade step renames the network interfaces according to the new NIC naming rules and re-configures the installed modules.
it: Il sistema di base è stato completamente aggiornato nel passaggio precedente; la fase post-aggiornamento rinomina le interfacce di rete in base alle nuove regole di denominazione della NIC e riconfigura i moduli installati.

source: In this last step a fault can be recovered safely through the system console. At the end of the post-upgrade step SSH, Server Manager and the other services are available again.
it: Durante questo ultimo passaggio un eventuale problema può essere ripristinato in modo sicuro attraverso la console di sistema. Al termine del passaggio post-aggironamento SSH, Server Manager e gli altri servizi saranno nuovamente disponibili.

source: Any daily, weekly and monthly scheduled cron job will be started again within one hour since the system boot ends.
it: Ogni cron job giornaliero, settimanale e mensile verrà riavviato entro un'ora dall'avvio del sistema.

source: Post-upgrade checklist
it: Checklist post-aggiornamento

source: Some modules, like ownCloud, need to be upgraded or replaced manually. Refer to the Upgrade documentation of |product| 7
it: Alcuni moduli, come ownCloud, devono essere aggiornati o sostituiti manualmente. Fare riferimento alla documentazione di aggiornamento di |product| 7

source: Once the Server Manager is accessible again remember to refresh the browser cache with :kbd:`Ctrl + Shift + R` to fix display issues caused by the upgraded style sheets (CSS)
it: Una volta tornato accessibile ilServer Manager, sarà necessario rammentare di aggiornare la cache del browser con la combinazione di tasti :kbd:`Ctrl + Shift + R` per correggere eventuali problemi di visualizzazione causati dai fogli di stile aggiornati (CSS)

source: Upgrade completed check
it: Verifica procedura completata

source: To ensure the upgrade procedure has finished run ``systemd-analyze``. The output should begin like ::
it: Per verificare che la procedura di aggiornamento abbia effettivamente terminato la sua esecuzione è possibile utilizzare il comando ``systemd-analyze``. L'output dovrebbe essere simile a questo:

source: Upgrade errors check
it: Verifica errori aggiornamento

source: To check if any error occurred, run ::
it: Per verificare se si siano riscontrati errori, eseguire ::

source: Installed modules check
it: Verifica moduli installati

source: In :guilabel:`Software center`, check if the previously installed modules are still marked as installed on the upgraded system. Each module is composed by some packages: as the module compositions has changed from version 6 to 7, some module may appear as not installed. To fix it, try to install it again with the :guilabel:`add` button.
it: Controllare tramite il :guilabel:`Software center` se i moduli installati in precedenza siano ancora contrassegnati come installati sul sistema aggiornato. Ogni modulo è composto da alcuni pacchetti: poiché le composizioni dei moduli sono cambiate dalla versione 6 alla 7, alcuni di essi potrebbero apparire come non installati. Per risolvere il problema, dovrebbe essere sufficiente installarli di nuovo con il pulsante :guilabel:`aggiungi`.

source: Let's Encrypt certificate check
it: Verifica certificato Let's Encrypt

source: A Let's Encrypt certificate, if present, must be requested again from the :guilabel:`Server certificate` page. Then set it as the default system certificate from the same page. For more information, refer to the "Server certificate" manual page of |product| 7.
it: Il certificato Let's Encrypt, se presente, dovrà essere richiesto nuovamente attraverso la pagina :guilabel:`Certificato del server`. Andrà poi impostato dalla stessa pagina come certificato di sistema predefinito. Per ulteriori informazioni, consultare la pagina di manuale "Certificato server" di |product| 7.

source: Upgrade to Active Directory
it: Aggiornamento ad Active Directory

source: If the system requires a local Active Directory (AD) accounts provider, the Upgrade tool expects some additional parameters to be issued:
it: Se il sistema necessita di un account provider di tipo Active Directory (AD) locale, l' Upgrade tool prevede l'inserimento di alcuni parametri aggiuntivi:

source: The AD :guilabel:`DNS domain name`
it: Il :guilabel:`nome dominio DNS` di AD

source: The :guilabel:`NetBIOS domain name` (read only)
it: Il :guilabel:`nome dominio NetBIOS` (in sola lettura)

source: A green bridge interface
it: Un'interfaccia green di tipo bridge

source: The :guilabel:`Domain Controller IP address`: an additional, free IP address that AD services binds to. The IP must be in the same subnet of the green bridge
it: L' :guilabel:`indirizzo IP Domain Controller`: un indirizzo IP aggiuntivo libero a cui i servizi di Active Directory saranno associati. L'IP deve essere nella stessa subnet del bridge green

source: If a green bridge interface is not present go to the :guilabel:`Network` page and create one with :guilabel:`Create new logical interface`.
it: Se un'interfaccia bridge green non fosse presente, andrà creata dalla pagina :guilabel:`Rete` tramite il pulsante :guilabel:`Crea nuova interfaccia logica`.

source: The :guilabel:`NetBIOS domain name` is a read-only field. To change it, refer to the :guilabel:`Windows Network` page.
it: Il :guilabel:`nome dominio NetBIOS` è un campo di sola lettura. Per modificarlo, consultare la pagina :guilabel:`Rete Windows`.

source: In virtualized systems, remember to enable **promiscuous mode** in the hypervisor settings, otherwise access to AD will be blocked from LAN clients
it: Nel caso di sistemi virtualizzati, sarà necessario ricordarsi di abilitare **la modalità promiscua** nelle impostazioni dell'hypervisor, altrimenti non sarà permesso l'accesso ad AD ai client LAN

source: For more information refer also to the |product| 7 documentation, especially:
it: Per ulteriori informazioni, consultare anche la documentazione di |product| 7, in particolare:

source: the "Samba Active Directory local provider installation" section, under the "Users and groups" chapter
it: la sezione "Installazione del provider locale Samba Active Directory", nel capitolo "Utenti e gruppi"

source: the "Upgrade from |product| 6" chapter
it: il capitolo "Aggiornamento da |product| 6"

source: Upgrade risks and how to reduce them
it: Rischi legati all'upgrade e come ridurne l'impatto

source: A major system version upgrade is a risky operation and must be planned carefully.
it: Un aggiornamento della major version del sistema operativo è un'operazione rischiosa e deve essere pianificata attentamente.

source: Ensure the system has enough free **disk space**. The procedure checks the free disk space, but it is always a good idea to check it early, even before installing the :guilabel:`Upgrade tool` module.
it: Assicurarsi che il sistema abbia abbastanza spazio **su disco**. La procedura controlla lo spazio libero, ma è sempre consigliabile verificarlo in anticipo, anche prima di installare l' :guilabel:`Upgrade tool`.

source: Prepare a complete backup or snapshot of the whole system. A **power outage** or an **hardware fault** during the upgrade step, as long as an **unknown bug** in this procedure could compromise the system
it: Verificare di avere un backup completo o un'istantanea dell'intero sistema. Una **interruzione dell'alimentazione** o un **guasto hardware** durante la fase di aggiornamento, così come un ** errore sconosciuto ** in questa fase della procedura potrebbe compromettere il sistema

source: Consider the **system downtime** and how it impacts on the end-users
it: Tenere contro del **downtime del sistema** e del conseguente impatto sugli utenti finali

source: Make a list of the modules that need to be configured, replaced, **upgraded manually** after the automated procedure completes. Refer to the Upgrade documentation of |product| 7
it: Creare un elenco dei moduli che dovranno essere configurati, sostituiti, **aggiornati manualmente** al termine della procedura automatizzata. Fare riferimento alla documentazione di aggiornamento di |product| 7

source: During the upgrade any existing **custom template** is archived into ``/root/templates-custom.upgrade/``. It is recommended to check the existing customized templates before starting the upgrade procedure and decide if and how to restore them
it: Durante l'aggiornamento, qualsiasi **template custom** esistente verrà archiviato in ``/root/templates-custom.upgrade/``. Si consiglia di controllare i template personalizzati esistenti prima di iniziare la procedura di aggiornamento e decidere se e come ripristinarli

source: The system is **disconnected from the network** during the upgrade step and until the post-upgrade step completes. If any error occurs during those steps a direct **console access** is required.
it: Il sistema verrà **disconnesso dalla rete** durante la fase di aggiornamento e fino al completamento della fase post-aggiornamento. Se durante questi passaggi si dovesse verificare un errore, sarà necessario un **accesso alla console** diretto per intervenire.
