Repository: DavidePrincipi/docs
Catalog: administrator-manual/*/locale/*/LC_MESSAGES/webvirtmgr.po
Languages: es, it

source: This tool is used to manage :index:`virtual machine` through a simple web interface:
es: Esta herramienta se utiliza para gestionar: index:`máquina virtual` a través de una sencilla interfaz web
it: Queto tool è usato per la gestione di :index:`macchine virtuali` attraverso una semplice interfaccia web:

source: Create and destroy new machines (:index:`KVM`)
es: Crear y destruir nuevas máquinas (:index:`KVM`)
it: Creazione e rimozione di macchine virtuali (:index:`KVM`)

source: Create custom template of virtual machines
es: Crear plantilla personalizada de máquinas virtuales
it: Creazione di template per la creazione di macchine

source: Easy shell remote access
es: Acceso remoto a shell fácil
it: Accesso remoto tramite shell

source: Amazing UI
es: Increíble interfaz de usuario
it: Interfaccia grafica accattivante

source: Configuration
es: Configuración
it: Configurazione

source: The web application listen on port **8000** of your host machine, for example: ``http://HOST_IP:8000/``.
es: La aplicación web escucha en el puerto **8000** de su máquina host, por ejemplo: ``http://HOST_IP:8000/``.
it: L’applicazione web è in ascolto sulla porta **8000** del server, per esempio: ``http://HOST_IP:8000/``.

source: The service is disabled by default.
es: El servidor está deshabilitado de manera predeterminada
it: Il servizio è disabilitato di default.

source: From the :guilabel:`Virtual machines` page you can:
es: Desde la página :guilabel:`Máquinas virtuales` puede:
it: Dalla pagina :guilabel:`Macchine virtuali` è possibile:

source: enable the virtual machines manager
es: habilitar el administrador de máquinas virtuales
it: abilitare il gestore delle macchine virtuali

source: enable the virtual machines console access from web browser
es: habilitar el acceso a la consola de máquinas virtuales desde el navegador web
it: abilitare l’accesso alla console delle macchine virtuali direttamente dal browser

source: To access the web interface you must login with credentials that can be found on the same page:
es: Para acceder a la interfaz web, debe iniciar sesión con credenciales que se pueden encontrar en la misma página:
it: Per accedere all’interfaccia web, effettuare il login con le credenziali disponibili nella pagina stessa:

source: *User:* admin
es: *Usuario:* admin
it: *Utente*: admin

source: *Password*: random alphanumeric (editable)
es: *Contraseña*: aleatoria alfanumérica (editable)
it: *Password*: casuale, alfanumerica (modificabile)

source: Do not create network bridges using WebVirtManager interface. Just create the bridge inside :guilabel:`Network` page and use it under WebVirtManager.
es: No cree puentes de red utilizando la interfaz WebVirtManager. Basta con crear el puente dentro de la página :guilabel:`Red` y usarla en WebVirtManager.
it: Non creare bridge di rete usando l’interfaccia di WebVirtManager. È sufficiente creare il bridge dalla pagina :guilabel:`Rete` ed utilizzarlo all’interno di WebVirtManager.

source: For more information, see official documentation:
es: Para obtener más información, consulte la documentación oficial:
it: Per maggiori informazioni si rimanda alla documentazione ufficiale:
